package _Yandex._1_linear_search

/*
    Игра PirCraft происходит в двумерном мире, который состоит
    из блоков размером 1 на 1 метр. Остров игрока представляет
    собой набор столбцов различной высота, состоящих из блоков
    камня и окруженный морем. Над островом прошел сильный дождь
    который заполнил водой все низины, а не поместившаяся в них
    вода стекла в море, не увеличив его уровень

    По ландшафту острова определите сколько блоков воды осталось
    после дождя в низинах на острове
*/

fun solution(island: Array<Int>): Int {
    return 0
}

fun main() {
    val solution1 = intArrayOf(3, 1, 4, 3, 5, 1, 1, 3, 1) // 7
    val solution2 = intArrayOf(3, 2, 5, 2, 2, 5, 2, 2, 3) // 9
}
